{
  "language": "fr",
  "misc": {
    "learnMore": "En savoir plus",
    "gitHubLink": "Voir le dépot git",
    "projectLink": "Voir le projet",
    "frLang": "french",
    "enLang": "english"
  },
  "greetings": "Bienvenue sur mon CV en ligne où vous pourrez en apprendre plus sur moi et sur ce que je fais.",
  "name": "Palamara",
  "firstName": "Thomas",
  "birthDate": "05/11/1994",
  "email": "palamara.thomas@gmail.com",
  "position": "Développeur front-end",
  "linkdin": "https://www.linkedin.com/in/thomas-palamara-a8ab36a7/?locale=en_US",
  "location": {
    "city": "Londres",
    "Country": "Royaumes Unis",
    "countryCode": "UK"
  },
  "phoneNumber": {
    "fr": "(+33) 667 258 927",
    "en": "(+44) 741 401 0115"
  },
  "introduction": {
    "title": "À propos de moi",
    "text": "<p>J'ai toujours été très curieux du monde autour de moi. L'acquisition de nouvelles connaissances est une source de motivation pour moi, apprendre de nouvelles choses est une passion. Soyez donc prêts pour les questions.<br> Je suis un amoureux de science et adore l'informatique, les jeux vidéo, la science-fiction, la musique ...</p><p>Après le lycée, j'ai commencé mon cursus en chimie. Il se trouve que je me suis finalement tourné vers l'informatique pour obtenir mon DUT en : <span class=\"highlight\" data-highlight=\"1\">génie électrique et informatique industrielle</span>. C'était très stimulant d'apprendre la programmation et d'animer des robot et autres appareils électroniques.</p><p>Finalement, lors d'un stage, j'ai eu l'opportunité de développer une application Android. J'ai beaucoup apprécié travailler sur un concept plus abstrait et apprendre la programmation orientée objet. C'est pourquoi je me suis mis à étudier le <span class=\"highlight\" data-highlight=\"2\">developpement web</span>.</p><p>Depuis, j'ai démenager à <span class=\"highlight\" data-highlight=\"3\">Londres</span> et m'épanouis dans ma carrière de développeur front-end</p>"
  },
  "skills": {
    "title": "Mes compétences",
    "categories": [
      {
        "title": "Front-End",
        "description": "J'aime la liberté que nous offre la programmation pour nous permettre de donner vie à nos idées et permet aux utilisateurs de les apprécier. Je donne une grande importance à proposer une expérience intuitive.",
        "elements": ["JavaScript", "JQuery", "ReactJS", "HTML", "CSS", "Sass", "Bootstrap"]
      },
      {
        "title": "Outils",
        "description": "Utiliser les bons outils est une importante facette de la programmation. Ils vous font gagner du temps et vous simplifie la tache.",
        "elements": ["Git", "npm", "yarn", "Grunt", "Webpack", "WampServer", "Visual Studio Code"]
      },
      {
        "title": "Back-End",
        "description": "",
        "elements": ["SQL", "phpMyAdmin", "MongoDB", "NodeJS", "PHP"]
      },
      {
        "title": "Langues",
        "elements": ["Français: Maternelle", "English: Courant"]
      },
      {
        "title": "Design",
        "elements": ["Photoshop", "Illustrator", "Figma"]
      }
    ]
  },
  "projects": {
    "title": "Mes projets",
    "text": "Voici certains de mes projets. Certains sont toujours des travails en cours.",
    "elements": [
      {
        "active": true,
        "title": "Auction&nbsp;Price&nbsp;Track",
        "picture": "atp-client.png",
        "WIP": true,
        "git": "https://github.com/ThomasPalamara/auction-price-track-client",
        "url": "https://auction-price-track.netlify.com/",
        "description": {
          "short": "Ce projet aide les joueurs à suivre les prix de certains objets dans le jeu World of Warcraft et ainsi les aider à faire des profits",
          "long": "World of Warcraft est un RPG multijoueur en ligne avec sa propre économie. Les joueurs échangent des biens contre des pièces d'or à l'hôtel des ventes. Ces aventuriers ont besoin de fabriquer et échanger un bon nombre d'objets s'ils espèrent progresser dans leurs quêtes.\n Ce projet les aide à suivre ces objets et leurs composants pour les aider à faire du profit. Ils peuvent observer l'évolution de leur prix sur une période de 21 jours et ainsi décider quand les vendre ou quand les acheter."
        },
        "techs": ["React", "Scss", "Recharts", "ES6"]
      },
      {
        "active": true,
        "title": "Auction&nbsp;Price&nbsp;Track API",
        "picture": "atp-server.png",
        "git": "https://github.com/ThomasPalamara/auction-price-track-server",
        "url": "https://auction-price-track-server.herokuapp.com/api/docs/",
        "description": {
          "short": "L'API qui collecte les données et les rend disponibles sur Auction Price Track.",
          "long": "C'est la partie serveur du projet Auction Price Track. Blizzard (Developpeur de World of Warcraft) fournis une API qui nous permet de voir l'état de l'hôtel des ventes en jeu et donc les données dont nous avons besoin."
        },
        "techs": ["NodeJS", "API Rest", "MongoDB", "Mongoose"]
      }
    ]
  },
  "ending": {
    "mainText": "Thank you for reading me.",
    "secondaryText": "Si vous souhaitez me contacter n'hésitez pas a me contacter via mon profil <a href=\"https://www.linkedin.com/in/thomas-palamara-a8ab36a7/\" target=\"_blank\" rel=\"noopener\"> ou en utilisant mes coordonnées présentes sur mon CV<a data-cv-link target=\"_blank\" rel=\"noopener\">resume</a>"
  }
}
