{
    "greetings": "Welcome on my digital resume, where you'll learn more about myself and what I do.",
    "name": "Thomas",
    "firstName": "Palamara",
    "birthDate": "05/11/1994",
    "email": "palamara.thomas@gmail.com",
    "position": "Developpeur Front-End",
    "location": {
        "city": "London",
        "Country": "United Kingdom",
        "countryCode": "UK"
    },
    "phoneNumber": {
        "fr": "(+33) 667 258 927",
        "en": "(+44) 770 720 4667"
    },
    "introduction": {
        "title": "About Myself",
        "text": "<p>I’ve always been highly curious about the world around me. The acquisition of new knowledge is a great motivation for me, I’m always keen to learn new stuff. Be ready for the questions.<br>I’m a science lover and a geek keen on IT, video game, science fiction, music …<\/p><p>After high school I started to learn chemistry. As it turns out life led me back to computers with the my two-years degree in electrical engineering and computer science. I had a great time learning programming and animating robots and other electronic stuff.<\/p><p>Finally, I developed an android application as part of an internship. I wanted to experience all the possibilities that programming languages offers. I ended up learning web development.<\/p><p>Since then I moved in London to work in this great city.<\/p>"
    },
    "skills": {
        "title": "My Skills",
        "categories": [{
            "title": "Front-End",
            "description": "I love how programming allow us to give life to our ideas and allow users enjoy them. I place great emphasis on intuitive and clean experiences.",
            "elements": ["JavaScript", "JQuery", "ReactJS", "HTML", "CSS", "Sass", "Bootstrap"]
        }, {
            "title": "Tools",
            "description": "Using the right tools is the most important thing while coding. Some save you time, some simplify your work... If something is bothering you there is a tool to help you.",
            "elements": ["Git", "npm", "yarn", "Grunt", "Webpack", "WampServer", "Visual Studio Code"]
        }, {
            "title": "Back-End",
            "description": "Using the right tools is the most important thing while coding. Some save you time, some simplify your work... If something is bothering you there is a tool to help you.",
            "elements": ["SQL", "phpMyAdmin", "MongoDB", "NodeJS", "PHP"]
        }, {
            "title": "Languages",
            "elements": ["French: Native", "English: Advanced"]
        },{
            "title": "Design",
            "elements": ["Photoshop", "Illustrator", "Figma"]
        }]
    },
    "projects":{
        "title": "Some of my projects",
        "text": "Here some of my projects. Not much but working on filling this section !",
        "elements":[{
            "title": "Auction Price Track<br> Client",
            "description": "This project helps people to track the price of some items in the game World of Warcraft thus helps them make profits.\nThe client part allow users to select their what items interest them and display the statistics.",
            "techs": ["React", "Scss", "D3.js", "ES6"]
        },{
            "title": "Auction Price Track Server API",
            "description": "It's the server part of the previous project. Blizzard (Developper of World Of warcraft) provides an API that allow us to see the state of the auction house in game and so the data we need. ",
            "techs": ["NodeJS", "API Rest", "MongoDB", "Mongoose"]
        }]
    }
}
